In [621]:
import pandas as pd
import numpy as np

In [741]:
data = {'Store':['Walmart','Walmart','Costco','Costco','Target','Target'],
        'Customer':['Tim','Jermy','Mark','Denice','Ray','Sam'],
        'Sales':[150,200,550,90,430,120]}

In [742]:
df = pd.DataFrame(data)

In [743]:
df

  Customer  Sales    Store
0      Tim    150  Walmart
1    Jermy    200  Walmart
2     Mark    550   Costco
3   Denice     90   Costco
4      Ray    430   Target
5      Sam    120   Target

In [802]:
df['new']= pd.Series(np.random.randint(6),index=df.index)

In [771]:
df

  Customer  Sales    Store  new
0      Tim    150  Walmart    1
1    Jermy    200  Walmart    1
2     Mark    550   Costco    1
3   Denice     90   Costco    1
4      Ray    430   Target    1
5      Sam    120   Target    1

In [772]:
df.dropna(axis = 1,inplace=True)

In [773]:
df

  Customer  Sales    Store  new
0      Tim    150  Walmart    1
1    Jermy    200  Walmart    1
2     Mark    550   Costco    1
3   Denice     90   Costco    1
4      Ray    430   Target    1
5      Sam    120   Target    1

In [774]:
df[['Sales','Customer']].iloc[2]

Sales        550
Customer    Mark
Name: 2, dtype: object

In [775]:
df['Store'].nunique()

3

In [776]:
df['Store'].value_counts()

Costco     2
Target     2
Walmart    2
Name: Store, dtype: int64

In [777]:
by_stor = df.groupby('Store')

In [778]:
df.sort_values(by='Store',ascending=False)

  Customer  Sales    Store  new
0      Tim    150  Walmart    1
1    Jermy    200  Walmart    1
4      Ray    430   Target    1
5      Sam    120   Target    1
2     Mark    550   Costco    1
3   Denice     90   Costco    1

In [779]:
by_stor.sum().loc['Target']

Sales    550
new        2
Name: Target, dtype: int64

In [780]:
by_customer = df.groupby(['Store','Customer'])

In [781]:
by_customer.sum()

                  Sales  new
Store   Customer
Costco  Denice       90    1
        Mark        550    1
Target  Ray         430    1
        Sam         120    1
Walmart Jermy       200    1
        Tim         150    1

In [782]:
by_customer = df.groupby(['Store'])

In [783]:
by_customer.sum()

         Sales  new
Store
Costco     640    2
Target     550    2
Walmart    350    2

In [784]:
by_customer.count()

         Customer  Sales  new
Store
Costco          2      2    2
Target          2      2    2
Walmart         2      2    2

In [785]:
by_customer.describe()

        Sales                                                         new  \
        count   mean         std    min    25%    50%    75%    max count
Store
Costco    2.0  320.0  325.269119   90.0  205.0  320.0  435.0  550.0   2.0
Target    2.0  275.0  219.203102  120.0  197.5  275.0  352.5  430.0   2.0
Walmart   2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0   2.0


        mean  std  min  25%  50%  75%  max
Store
Costco   1.0  0.0  1.0  1.0  1.0  1.0  1.0
Target   1.0  0.0  1.0  1.0  1.0  1.0  1.0
Walmart  1.0  0.0  1.0  1.0  1.0  1.0  1.0

In [786]:
by_customer.describe().transpose()

Store            Costco      Target     Walmart
Sales count    2.000000    2.000000    2.000000
      mean   320.000000  275.000000  175.000000
      std    325.269119  219.203102   35.355339
      min     90.000000  120.000000  150.000000
      25%    205.000000  197.500000  162.500000
      50%    320.000000  275.000000  175.000000
      75%    435.000000  352.500000  187.500000
      max    550.000000  430.000000  200.000000
new   count    2.000000    2.000000    2.000000
      mean     1.000000    1.000000    1.000000
      std      0.000000    0.000000    0.000000
      min      1.000000    1.000000    1.000000
      25%      1.000000    1.000000    1.000000
      50%      1.000000    1.000000    1.000000
      75%      1.000000    1.000000    1.000000
      max      1.000000    1.000000    1.000000

In [787]:
by_customer.describe().transpose()['Costco']

Sales  count      2.000000
       mean     320.000000
       std      325.269119
       min       90.000000
       25%      205.000000
       50%      320.000000
       75%      435.000000
       max      550.000000
new    count      2.000000
       mean       1.000000
       std        0.000000
       min        1.000000
       25%        1.000000
       50%        1.000000
       75%        1.000000
       max        1.000000
Name: Costco, dtype: float64

In [788]:
df

  Customer  Sales    Store  new
0      Tim    150  Walmart    1
1    Jermy    200  Walmart    1
2     Mark    550   Costco    1
3   Denice     90   Costco    1
4      Ray    430   Target    1
5      Sam    120   Target    1

In [789]:
df['Store'].apply(lambda x:len(x))

0    7
1    7
2    6
3    6
4    6
5    6
Name: Store, dtype: int64

In [737]:
df['Store'][:3]

0    Walmart
1    Walmart
2     Costco
Name: Store, dtype: object

In [748]:
type(np.nan)

float

In [749]:
df

  Customer  Sales    Store       new
0      Tim    150  Walmart  0.639983
1    Jermy    200  Walmart  1.178684
2     Mark    550   Costco  0.118869
3   Denice     90   Costco  0.698746
4      Ray    430   Target  0.779720
5      Sam    120   Target  0.939859

In [751]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [790]:
df.columns

Index(['Customer', 'Sales', 'Store', 'new'], dtype='object')

In [810]:
df['new'].iloc[2] =np.nan

SyntaxError: invalid syntax (<ipython-input-810-c3d9e0657486>, line 1)

In [807]:
df['new'].iloc[2]

nan

In [811]:
df

  Customer  Sales    Store  new
0      Tim    150  Walmart  3.0
1    Jermy    200  Walmart  3.0
2     Mark    550   Costco  NaN
3   Denice     90   Costco  3.0
4      Ray    430   Target  3.0
5      Sam    120   Target  3.0

In [814]:
df.pivot_table(values='Sales',index='Store',columns='Customer')

Customer  Denice  Jermy   Mark    Ray    Sam    Tim
Store
Costco      90.0    NaN  550.0    NaN    NaN    NaN
Target       NaN    NaN    NaN  430.0  120.0    NaN
Walmart      NaN  200.0    NaN    NaN    NaN  150.0

In [815]:
import os

In [822]:
cwd = os.getcwd()

In [823]:
cwd

'C:\\Users\\User1\\Documents\\udemy\\dataScience\\DataScience_Dr.Junaid Qazi\\Course_Material'

In [825]:
cwd2 = os.getcwdb()

C:\Users\User1\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning: The Windows bytes API has been deprecated, use Unicode filenames instead
  if __name__ == '__main__':

In [826]:
cwd2

b'C:\\Users\\User1\\Documents\\udemy\\dataScience\\DataScience_Dr.Junaid Qazi\\Course_Material'

In [841]:
files = [fi for fi in os.listdir('.') if os.path.isfile(fi) ]

In [842]:
files

['.DS_Store', 'DV_Lecture.pdf', 'ML_Introduction.pdf', 'Untitled.ipynb']

In [843]:
for f in files:
    print(f)

.DS_Store
DV_Lecture.pdf
ML_Introduction.pdf
Untitled.ipynb

In [ ]:
files= [f for f in os.listdir('.')if os.path.isfile(f)]

In [847]:
lst=np.arange(10)

In [888]:
lst2 = [2, 3, 4, 5, 6, 7, 8, 9,10,11,12,15,17,21]

In [889]:
newlist = []
for i in lst2:
    flag = 0
    if(i==2):
        newlist.append(i)
        continue
    s= int(i/2)
    if(s>1):
        s=np.arange(2,s+2)        
        for y in s:
            if(i%y==0):
                flag = 1
    if(flag==0):
        newlist.append(i)

In [890]:
newlist

[2, 3, 5, 7, 11, 17]

In [873]:
y =np.arange(2,4)
y

array([2, 3])